/*
*程序名：试剂稀释
*作者：何卓远
*编制时间：2018-10-29
*功能：一种药剂可以被稀释成不同的浓度供病人使用，且只能稀释不能增加浓度；又已知医院规定同一瓶药剂只能给某个病人以及排在他后面的若干人使用。现为了能最大限度利用每一瓶药剂(不考虑每一瓶容量)，在给出的一个病人用药浓度序列(病人的顺序不能改变)中找出能同时使用一瓶药剂的最多人数。
*/

#include <iostream>       //预处理指令

using namespace std;

int main()
{
	int max = 0,f[101] = { 0 };
	int n, i, j;
	float a[101] = { 0 };
		cin >> n;
	for (i = 1; i <= n; i++)
	{
		cin >> a[i];
	}              //读入浓度到数组a
	for (i = 1; i <= n; i++)    
	{
		f[i] = 1;       //f[i]表示前i个数的最长序列长度
		for (j = 1; j < i; j++)
		{

			if (a[j] >= a[i])
			{
				if (f[i] < f[j] + 1) f[i] = f[j] + 1;
			}
		}
	}
	for (i = 1; i <= n; i++)
	{
		if (f[i] > max) max = f[i];
	}
	cout << max << endl;
	return 0;
}
